1C/Enums/EPA_СложностьЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>EPA_СложностьЗаданий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводКода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронноеНажатие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Загадки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задания</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1C/Enums/EPA_СложностьЗаданий/Ext/ManagerModule.bsl
Функция ПолучитьЗначениеПеречисления(task_type) Экспорт

	Если task_type = "" Тогда
		Возврат Неопределено;	
	ИначеЕсли task_type = "peach" Тогда
		Возврат Перечисления.EPA_СложностьЗаданий.СинхронноеНажатие;
	ИначеЕсли task_type = "voice" Тогда
		Возврат Перечисления.EPA_СложностьЗаданий.Загадки;
	ИначеЕсли task_type = "video" Тогда
		Возврат Перечисления.EPA_СложностьЗаданий.Задания;	
	КонецЕсли;
	
КонецФункции
